module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرة في ملفات الأوامر
	onlyadminbox: {
		shortDescription: "تشغيل/إيقاف صندوق الإداريين فقط القادرين على استخدام البوت",
		longDescription: "تشغيل/إيقاف صندوق الإداريين فقط القادرين على استخدام البوت",
		guide: "   {pn} [تشغيل | إيقاف]",
		text: {
			turnedOn: "تم تشغيل وضع الإداريين فقط ويمكن لإداريي المجموعة فقط استخدام البوت",
			turnedOff: "تم إيقاف وضع الإداريين فقط ويمكن للجميع استخدام البوت",
			syntaxError: "خطأ في الصيغة، يرجى استخدام {pn} تشغيل أو {pn} إيقاف"
		}
	},
	adduser: {
		shortDescription: "إضافة مستخدم إلى مجموعة الدردشة",
		longDescription: "إضافة مستخدم إلى مجموعة الدردشة الخاص بك",
		guide: "   {pn} [رابط الملف الشخصي | معرف]",
		text: {
			alreadyInGroup: "موجود بالفعل في المجموعة",
			successAdd: "- تمت إضافة %1 أعضاء بنجاح إلى المجموعة",
			failedAdd: "- فشل في إضافة %1 أعضاء إلى المجموعة",
			approve: "- تمت إضافة %1 أعضاء إلى قائمة الموافقة",
			invalidLink: "الرجاء إدخال رابط Facebook صحيح",
			cannotGetUid: "لا يمكن الحصول على معرف هذا المستخدم",
			linkNotExist: "هذا الرابط الشخصي غير موجود",
			cannotAddUser: "البوت محظور أو قام هذا المستخدم بحظر الغرباء من إضافتهم إلى المجموعة"
		}
	},
	admin: {
		shortDescription: "إضافة، إزالة، تعديل دور الإدارة",
		longDescription: "إضافة، إزالة، تعديل دور الإدارة",
		guide: "   {pn} [إضافة | -a] <معرف>: إضافة دور الإدارة للمستخدم\n\t  {pn} [إزالة | -r] <معرف>: إزالة دور الإدارة للمستخدم\n\t  {pn} [قائمة | -l]: قائمة جميع المشرفين",
		text: {
			added: "✅ | تمت إضافة دور الإدارة لـ %1 مستخدمين:\n%2",
			alreadyAdmin: "\n⚠️ | %1 مستخدمين لديهم بالفعل دور الإدارة:\n%2",
			missingIdAdd: "⚠️ | الرجاء إدخال معرف أو ذكر المستخدم لإضافة دور الإدارة",
			removed: "✅ | تمت إزالة دور الإدارة لـ %1 مستخدمين:\n%2",
			notAdmin: "⚠️ | %1 مستخدمين ليس لديهم دور الإدارة:\n%2",
			missingIdRemove: "⚠️ | الرجاء إدخال معرف أو ذكر المستخدم لإزالة دور الإدارة",
			listAdmin: "👑 | قائمة المشرفين:\n%1"
		}
	},
	adminonly: {
		shortDescription: "تشغيل/إيقاف وضع الإداريين فقط القادرين على استخدام البوت",
		longDescription: "تشغيل/إيقاف وضع الإداريين فقط القادرين على استخدام البوت",
		guide: "{pn} [تشغيل | إيقاف]",
		text: {
			turnedOn: "تم تشغيل وضع الإداريين فقط ويمكن لإداريي المجموعة فقط استخدام البوت",
			turnedOff: "تم إيقاف وضع الإداريين فقط ويمكن للجميع استخدام البوت",
			syntaxError: "خطأ في الصيغة، يرجى استخدام {pn} تشغيل أو {pn} إيقاف"
		}
	},
  all: {
	shortDescription: "علامة الكل",
	longDescription: "علامة الكل من أعضاء مجموعتك",
	guide: "{pn} [المحتوى | فارغ]"
},
anime: {
	shortDescription: "صورة أنمي عشوائية",
	longDescription: "صورة أنمي عشوائية",
	guide: "{pn} <نقطة النهاية>\n   قائمة نقاط النهاية: نيكو، كيتسون، عناق، مضاجعة، ويفو، بكاء، قبلة، صفعة، تفاخر، لكمة",
	text: {
		loading: "جاري تحميل الصورة، يرجى الانتظار...",
		error: "حدث خطأ، يرجى المحاولة مرة أخرى لاحقًا"
	}
},
antichangeinfobox: {
	shortDescription: "مانع تغيير معلومات الصندوق",
	longDescription: "تشغيل/إيقاف مانع تغيير معلومات الصندوق",
	guide: "   {pn} avt [تشغيل | إيقاف]: مانع تغيير صورة مجموعة دردشة\n   {pn} name [تشغيل | إيقاف]: مانع تغيير اسم الصندوق دردشة\n   {pn} theme [تشغيل | إيقاف]: مانع تغيير موضوع الصندوق دردشة\n   {pn} emoji [تشغيل | إيقاف]: مانع تغيير الرموز التعبيرية للصندوق دردشة",
	text: {
		antiChangeAvatarOn: "تم تشغيل ميزة منع تغيير صورة الصندوق دردشة",
		antiChangeAvatarOff: "تم إيقاف ميزة منع تغيير صورة الصندوق دردشة",
		missingAvt: "لم تقم بتعيين صورة لصندوق الدردشة",
		antiChangeNameOn: "تم تشغيل ميزة منع تغيير اسم الصندوق دردشة",
		antiChangeNameOff: "تم إيقاف ميزة منع تغيير اسم الصندوق دردشة",
		antiChangeThemeOn: "تم تشغيل ميزة منع تغيير موضوع الصندوق دردشة",
		antiChangeThemeOff: "تم إيقاف ميزة منع تغيير موضوع الصندوق دردشة",
		antiChangeEmojiOn: "تم تشغيل ميزة منع تغيير الرموز التعبيرية للصندوق دردشة",
		antiChangeEmojiOff: "تم إيقاف ميزة منع تغيير الرموز التعبيرية للصندوق دردشة",
		antiChangeAvatarAlreadyOn: "صندوق الدردشة الخاص بك يعمل حاليًا بميزة منع تغيير صورة الصندوق",
		antiChangeNameAlreadyOn: "صندوق الدردشة الخاص بك يعمل حاليًا بميزة منع تغيير اسم الصندوق",
		antiChangeThemeAlreadyOn: "صندوق الدردشة الخاص بك يعمل حاليًا بميزة منع تغيير موضوع الصندوق",
		antiChangeEmojiAlreadyOn: "صندوق الدردشة الخاص بك يعمل حاليًا بميزة منع تغيير الرموز التعبيرية للصندوق"
	}
},
appstore: {
	shortDescription: "البحث عن تطبيق في متجر التطبيقات",
	longDescription: "البحث عن تطبيق في متجر التطبيقات",
	text: {
		missingKeyword: "لم تقم بإدخال أي كلمة مفتاحية",
		noResult: "لم يتم العثور على نتائج للكلمة المفتاحية %1"
	}
},
autosetname: {
	shortDescription: "تغيير اسم العضو تلقائياً",
	longDescription: "تغيير اسم العضو تلقائياً عند انضمام عضو جديد",
	guide: "   {pn} set <الاسم>: استخدم لتعيين إعداد لتغيير اسم العضو تلقائياً، مع بعض الاختصارات:\n   + {userName}: اسم العضو الجديد\n   + {userID}: معرف العضو\n   مثال:\n    {pn} set {userName} 🚀\n\n   {pn} [تشغيل | إيقاف]: استخدم لتشغيل/إيقاف هذه الميزة\n\n   {pn} [عرض | معلومات]: عرض الإعداد الحالي",
	text: {
		missingConfig: "الرجاء إدخال التكوين المطلوب",
		configSuccess: "تم تعيين التكوين بنجاح",
		currentConfig: "تكوين autosetname الحالي في مجموعة الدردشة الخاصة بك هو:\n%1",
		notSetConfig: "لم يتم تعيين تكوين autosetname في مجموعتك",
		syntaxError: "خطأ في الصيغة، يمكن استخدام فقط \"{pn} تشغيل\" أو \"{pn} إيقاف\"",
		turnOnSuccess: "تم تشغيل ميزة autosetname بنجاح",
		turnOffSuccess: "تم إيقاف ميزة autosetname بنجاح",
		error: "حدث خطأ أثناء استخدام ميزة autosetname، جرب إيقاف ميزة الرابط المدعو في المجموعة وحاول مرة أخرى لاحقًا"
	}
},
avatar: {
	shortDescription: "إنشاء صورة شخصية أنمي",
	longDescription: "إنشاء صورة شخصية أنمي مع توقيع",
	guide: "{p}{n} <معرف الشخصية أو اسم الشخصية> | <نص الخلفية> | <التوقيع> | <اسم اللون الخلفية أو اللون الهيكس>\n{p}{n} مساعدة: عرض كيفية استخدام هذا الأمر",
	text: {
		initImage: "جاري تهيئة الصورة، الرجاء الانتظار...",
		invalidCharacter: "حاليًا هناك فقط %1 شخصية في النظام، الرجاء إدخال معرف الشخصية أقل من",
		notFoundCharacter: "لم يتم العثور على شخصية بالاسم %1 في قائمة الشخصيات",
		errorGetCharacter: "حدث خطأ أثناء الحصول على بيانات الشخصية:\n%1: %2",
		success: "✅ صورتك الشخصية\nالشخصية: %1\nالمعرف: %2\nنص الخلفية: %3\nالتوقيع: %4\nاللون: %5",
		defaultColor: "افتراضي",
		error: "حدث خطأ\n%1: %2"
	}
},
badwords: {
	shortDescription: "تشغيل/إيقاف تحذير الكلمات السيئة",
	longDescription: "تشغيل/إيقاف/إضافة/إزالة تحذير الكلمات السيئة، إذا قام عضو بانتهاكها سيتم تحذيره، وفي المرة الثانية سيتم طرده من صندوق الدردشة",
	guide: "   {pn} add <الكلمات>: إضافة كلمات ممنوعة (يمكنك إضافة عدة كلمات مفصولة بفواصل \",\" أو خطوط عمودية \"|\")\n   {pn} delete <الكلمات>: حذف الكلمات الممنوعة (يمكنك حذف عدة كلمات مفصولة بفواصل \",\" أو خطوط عمودية \"|\")\n   {pn} list <اختباء | اتركه فارغًا>: إيقاف تشغيل التحذير (أضف \"اختباء\" لإخفاء الكلمات الممنوعة)\n   {pn} unwarn [<معرف العضو> | <@ذكر العضو>]: إزالة تحذير واحد من عضو واحد\n   {pn} on: تعطيل التحذير\n   {pn} off: تفعيل التحذير",
	text: {
		onText: "تفعيل",
		offText: "تعطيل",
		onlyAdmin: "⚠️ | يمكن للمشرفين فقط إضافة كلمات ممنوعة إلى القائمة",
		missingWords: "⚠️ | لم تقم بإدخال الكلمات الممنوعة",
		addedSuccess: "✅ | تمت إضافة %1 كلمات ممنوعة إلى القائمة",
		alreadyExist: "❌ | %1 كلمات ممنوعة موجودة بالفعل في القائمة من قبل: %2",
		tooShort: "⚠️ | %1 كلمات ممنوعة لا يمكن إضافتها إلى القائمة لأنها أقل من 2 أحرف: %2",
		onlyAdmin2: "⚠️ | يمكن للمشرفين فقط حذف كلمات ممنوعة من القائمة",
		missingWords2: "⚠️ | لم تقم بإدخال الكلمات للحذف",
		deletedSuccess: "✅ | تم حذف %1 كلمات ممنوعة من القائمة",
		notExist: "❌ | %1 كلمات ممنوعة غير موجودة في القائمة من قبل: %2",
		emptyList: "⚠️ | قائمة الكلمات الممنوعة في مجموعتك فارغة حالياً",
		badWordsList: "📑 | قائمة الكلمات الممنوعة في مجموعتك: %1",
		onlyAdmin3: "⚠️ | يمكن للمشرفين فقط %1 هذه الميزة",
		turnedOnOrOff: "✅ | تم تفعيل تحذير الكلمات الممنوعة بنجاح",
		onlyAdmin4: "⚠️ | يمكن للمشرفين فقط حذف تحذير الكلمات الممنوعة",
		missingTarget: "⚠️ | لم تقم بإدخال معرف العضو أو ذكر العضو",
		notWarned: "⚠️ | العضو %1 لم يتم تحذيره بسبب الكلمات الممنوعة",
		removedWarn: "✅ | تم إزالة تحذير الكلمات الممنوعة للعضو %1 | %2",
		warned: "⚠️ | تم اكتشاف الكلمات الممنوعة \"%1\" في رسالتك، إذا استمريت في الانتهاك ستتم طرد من المجموعة.",
		warned2: "⚠️ | تم اكتشاف الكلمات الممنوعة \"%1\" في رسالتك، لقد انتهكت مرتين وستتم طرد من المجموعة.",
		needAdmin: "يحتاج البوت إلى امتيازات المشرف لطرد الأعضاء المخالفين",
		unwarned: "✅ | تم إزالة تحذير الكلمات الممنوعة للعضو %1 | %2"
	}
},
balance: {
	shortDescription: "عرض رصيدك",
	longDescription: "عرض رصيدك أو رصيد الشخص المعني بالذكر",
	guide: "   {pn}: عرض رصيدك\n   {pn} <@tag>: عرض رصيد الشخص المعني بالذكر",
	text: {
		money: "لديك %1$",
		moneyOf: "%1 يمتلك %2$"
	}
},
batslap: {
	shortDescription: "صورة للصفع بالخفاش",
	longDescription: "صورة للصفع بالخفاش",
	text: {
		noTag: "يجب عليك وسم الشخص الذي ترغب في صفعه"
	}
},
busy: {
	shortDescription: "تفعيل وضع عدم الإزعاج",
	longDescription: "تفعيل وضع عدم الإزعاج، عندما يتم وسمك سيقوم البوت بإخطارك",
	guide: "   {pn} [فارغ | <سبب>]: تفعيل وضع عدم الإزعاج\n   {pn} إيقاف: إيقاف وضع عدم الإزعاج",
	text: {
		turnedOff: "✅ | تم إيقاف وضع عدم الإزعاج بنجاح",
		turnedOn: "✅ | تم تفعيل وضع عدم الإزعاج بنجاح",
		turnedOnWithReason: "✅ | تم تفعيل وضع عدم الإزعاج بسبب: %1",
		alreadyOn: "المستخدم %1 مشغول حاليًا",
		alreadyOnWithReason: "المستخدم %1 مشغول حاليًا بسبب: %2"
	}
},
callad: {
	shortDescription: "إرسال رسالة إلى مدير البوت",
	longDescription: "إرسال تقرير أو تعليق أو خلل إلى مدير البوت",
	guide: "   {pn} <الرسالة>",
	text: {
		missingMessage: "الرجاء إدخال الرسالة التي ترغب في إرسالها إلى المدير",
		sendByGroup: "\n- تم الإرسال من المجموعة: %1\n- معرف الموضوع: %2",
		sendByUser: "\n- تم الإرسال من المستخدم",
		content: "\n\nالمحتوى:\n─────────────────\n%1\n─────────────────\nالرد على هذه الرسالة لإرسال رسالة إلى المستخدم",
		success: "تم إرسال رسالتك إلى المدير بنجاح!",
		reply: "📍 رد من المدير %1:\n─────────────────\n%2\n─────────────────\nالرد على هذه الرسالة لمتابعة إرسال الرسالة إلى المدير",
		replySuccess: "تم إرسال ردك إلى المدير بنجاح!",
		feedback: "📝 تعليق من المستخدم %1:\n- معرف المستخدم: %2%3\n\nالمحتوى:\n─────────────────\n%4\n─────────────────\nالرد على هذه الرسالة لإرسال رسالة إلى المستخدم",
		replyUserSuccess: "تم إرسال ردك إلى المستخدم بنجاح!"
	}
},
cmd: {
	shortDescription: "إدارة الأمر",
	longDescription: "إدارة ملفات الأوامر الخاصة بك",
	guide: "{pn} تحميل <اسم ملف الأمر>\n{pn} تحميل_الكل\n{pn} تثبيت <الرابط> <اسم ملف الأمر>: تنزيل وتثبيت ملف أمر من عنوان الويب، الرابط هو المسار إلى الملف (raw)",
	text: {
		missingFileName: "⚠️ | الرجاء إدخال اسم الأمر الذي ترغب في إعادة تحميله",
		loaded: "✅ | تم تحميل الأمر \"%1\" بنجاح",
		loadedError: "❌ | فشل تحميل الأمر \"%1\" بخطأ\n%2: %3",
		loadedSuccess: "✅ | تم التحميل بنجاح \"%1\" الأمر",
		loadedFail: "❌ | فشل التحميل \"%1\" الأمر\n%2",
		missingCommandNameUnload: "⚠️ | الرجاء إدخال اسم الأمر الذي ترغب في إلغاء تحميله",
		unloaded: "✅ | تم إلغاء تحميل الأمر \"%1\" بنجاح",
		unloadedError: "❌ | فشل إلغاء تحميل الأمر \"%1\" بخطأ\n%2: %3",
		missingUrlCodeOrFileName: "⚠️ | الرجاء إدخال الرابط أو الكود واسم ملف الأمر الذي ترغب في تثبيته",
		missingUrlOrCode: "⚠️ | الرجاء إدخال الرابط أو الكود لملف الأمر الذي ترغب في تثبيته",
		missingFileNameInstall: "⚠️ | الرجاء إدخال اسم الملف لحفظ الأمر (بامتداد .js)",
		invalidUrlOrCode: "⚠️ | غير قادر على الحصول على كود الأمر",
		alreadExist: "⚠️ | ملف الأمر موجود بالفعل، هل أنت متأكد أنك تريد استبدال الملف القديم؟\nقم بالرد على هذه الرسالة للمتابعة",
		installed: "✅ | تم تثبيت الأمر \"%1\" بنجاح، تم حفظ ملف الأمر في %2",
		installedError: "❌ | فشل تثبيت الأمر \"%1\" بخطأ\n%2: %3",
		missingFile: "⚠️ | ملف الأمر \"%1\" غير موجود",
		invalidFileName: "⚠️ | اسم ملف الأمر غير صالح",
		unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
	}
},
count: {
	shortDescription: "عرض عدد الرسائل في المجموعة",
	longDescription: "عرض عدد الرسائل لجميع الأعضاء أو لنفسك (منذ انضمام البوت إلى المجموعة)",
	guide: "   {pn}: لعرض عدد رسائلك\n   {pn} @tag: لعرض عدد رسائل الأشخاص الموجودين في الوسم\n   {pn} all: لعرض عدد رسائل جميع الأعضاء",
	text: {
		count: "عدد رسائل الأعضاء:",
		endMessage: "الأشخاص الذين ليس لديهم اسم في القائمة لم يقموا بإرسال أي رسائل.",
		page: "صفحة [%1/%2]",
		reply: "قم بالرد على هذه الرسالة برقم الصفحة لعرض المزيد",
		result: "%1 في المرتبة %2 بعدد %3 رسالة",
		yourResult: "أنت مصنف %1 وقد قمت بإرسال %2 رسالة في هذه المجموعة",
		invalidPage: "رقم الصفحة غير صالح"
	}
},
customrankcard: {
	shortDescription: "تصميم بطاقة الترتيب الخاصة",
	longDescription: "تصميم بطاقة الترتيب الخاصة بك",
	guide: {
		body: "   {pn} [لون_الخلفية_الرئيسي | لون_الخلفية_الفرعي | لون_الخط | لون_شريط_التقدم | لون_الخلفية_الفرعية | لون_النص | لون_الاسم | لون_التقدم | لون_المرتبة | لون_المستوى | إعادة]: <القيمة>"
			+ "\n   حيث:"
			+ "\n  + لون_الخلفية_الرئيسي | الخلفية <القيمة>: الخلفية الرئيسية لبطاقة الترتيب"
			+ "\n  + لون_الخلفية_الفرعي <القيمة>: الخلفية الفرعية"
			+ "\n  + لون_الخط <القيمة>: لون الخط بين الخلفية الرئيسية والخلفية الفرعية"
			+ "\n  + لون_شريط_التقدم <القيمة>: لون شريط التقدم"
			+ "\n  + لون_الخلفية_الفرعية <القيمة>: شفافية الخلفية الفرعية (من 0 -> 1)"
			+ "\n  + لون_النص <القيمة>: لون النص (كود اللون hex أو rgba)"
			+ "\n  + لون_الاسم <القيمة>: لون الاسم"
			+ "\n  + لون_التقدم <القيمة>: لون التقدم"
			+ "\n  + لون_المرتبة <القيمة>: لون المرتبة"
			+ "\n  + لون_المستوى <القيمة>: لون المستوى"
			+ "\n    • <القيمة> يمكن أن يكون كود لون hex أو rgb أو rgba أو تدرج (كل لون مفصول بمسافة) أو رابط صورة"
			+ "\n    • إذا كنت ترغب في استخدام التدرج، الرجاء إدخال الألوان المتعددة مفصولة بمسافة"
			+ "\n   {pn} إعادة: إعادة الإعدادات إلى الوضع الافتراضي"
			+ "\n   مثال:"
			+ "\n    {pn} لون_الخلفية_الرئيسي #fff000"
			+ "\n    {pn} لون_الخلفية_الفرعي rgba(255,136,86,0.4)"
			+ "\n    {pn} إعادة",
		attachment: {
			[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_1.jpg`]: "https://i.ibb.co/BZ2Qgs1/image.png",
			[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_2.png`]: "https://i.ibb.co/wy1ZHHL/image.png"
		}
	},
	text: {
		invalidImage: "رابط الصورة غير صالح، الرجاء اختيار رابط لصورة بامتداد (jpg، jpeg، png، gif)، يمكنك تحميل الصورة على https://imgbb.com/ واختيار \"الحصول على الرابط المباشر\" للحصول على رابط الصورة",
		invalidAttachment: "مرفق غير صالح، الرجاء اختيار ملف صورة",
		invalidColor: "كود لون غير صالح، الرجاء اختيار كود لون hex (6 أرقام) أو كود لون rgba",
		notSupportImage: "رابط الصورة غير مدعوم مع الخيار \"%1\"",
		success: "تم حفظ تغييراتك، إليك معاينة",
		reseted: "تمت إعادة تعيين جميع الإعدادات إلى الوضع الافتراضي",
		invalidAlpha: "الرجاء اختيار رقم من 0 -> 1"
	}
},
dhbc: {
	shortDescription: "لعبة اعتقال الكلمة",
	longDescription: "لعبة اعتقال الكلمة",
	guide: "{pn}",
	text: {
		reply: "الرجاء الرد على هذه الرسالة بالإجابة\n%1",
		isSong: "هذا هو اسم الأغنية للمغني %1",
		notPlayer: "⚠️ أنت لست اللاعب في هذا السؤال",
		correct: "🎉 مبروك أجبت بشكل صحيح وحصلت على %1$",
		wrong: "⚠️ لقد أجبت بشكل غير صحيح"
	}
},
emojimix: {
	shortDescription: "مزج 2 إيموجي",
	longDescription: "مزج 2 إيموجي معًا",
	guide: "   {pn} <إيموجي1> <إيموجي2>\n   مثال:  {pn} 🤣 🥰"
},
eval: {
	shortDescription: "اختبار الشيفرة بسرعة",
	longDescription: "اختبار الشيفرة بسرعة",
	guide: "{pn} <الشيفرة للاختبار>",
	text: {
		error: "❌ حدث خطأ:"
	}
},
event: {
	shortDescription: "إدارة أوامر الحدث",
	longDescription: "إدارة ملفات الأوامر الخاصة بالحدث",
	guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <الرابط> <اسم ملف الأمر>: تنزيل وتحميل أمر الحدث، الرابط هو مسار الملف الخاص بالأمر (نص خام)",
	text: {
		missingFileName: "⚠️ | الرجاء إدخال اسم الأمر الذي ترغب في إعادة تحميله",
		loaded: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
		loadedError: "❌ | فشل تحميل أمر الحدث \"%1\" بسبب خطأ\n%2: %3",
		loadedSuccess: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
		loadedFail: "❌ | فشل تحميل أمر الحدث \"%1\"\n%2",
		missingCommandNameUnload: "⚠️ | الرجاء إدخال اسم الأمر الذي ترغب في إلغائه",
		unloaded: "✅ | تم إلغاء تحميل أمر الحدث \"%1\" بنجاح",
		unloadedError: "❌ | فشل إلغاء تحميل أمر الحدث \"%1\" بسبب خطأ\n%2: %3",
		missingUrlCodeOrFileName: "⚠️ | الرجاء إدخال الرابط أو الكود واسم ملف الأمر الذي ترغب في تثبيته",
		missingUrlOrCode: "⚠️ | الرجاء إدخال الرابط أو الكود الخاص بملف الأمر الذي ترغب في تثبيته",
		missingFileNameInstall: "⚠️ | الرجاء إدخال اسم الملف لحفظ الأمر (بامتداد .js)",
		invalidUrlOrCode: "⚠️ | تعذر الحصول على كود الأمر",
		alreadExist: "⚠️ | الملف موجود بالفعل، هل أنت متأكد من رغبتك في استبدال الملف القديم؟\nيرجى الرد على هذه الرسالة للمتابعة",
		installed: "✅ | تم تثبيت أمر الحدث \"%1\" بنجاح، تم حفظ ملف الأمر على %2",
		installedError: "❌ | فشل تثبيت أمر الحدث \"%1\" بسبب خطأ\n%2: %3",
		missingFile: "⚠️ | الملف \"%1\" غير موجود",
		invalidFileName: "⚠️ | اسم الملف غير صالح",
		unloadedFile: "✅ | تم إلغاء تحميل أمر \"%1\""
	}
},
filteruser: {
	shortDescription: "تصفية أعضاء المجموعة",
	longDescription: "تصفية أعضاء المجموعة بناءً على عدد الرسائل أو الحسابات المحظورة",
	guide: "   {pn} [<عدد الرسائل> | die]",
	text: {
		needAdmin: "⚠️ | يُرجى إضافة البوت كمشرف في المجموعة لاستخدام هذا الأمر",
		confirm: "⚠️ | هل أنت متأكد من رغبتك في حذف أعضاء المجموعة الذين لديهم أقل من %1 رسالة؟\nالرجاء الرد على هذه الرسالة للتأكيد",
		kickByBlock: "✅ | تم حذف %1 من الأعضاء الذين لديهم حسابات محظورة",
		kickByMsg: "✅ | تم حذف %1 من الأعضاء الذين لديهم أقل من %2 رسالة",
		kickError: "❌ | حدث خطأ وتعذر حذف %1 من الأعضاء:\n%2",
		noBlock: "✅ | لا يوجد أعضاء لديهم حسابات محظورة",
		noMsg: "✅ | لا يوجد أعضاء لديهم أقل من %1 رسالة"
	}
},
getfbstate: {
	shortDescription: "الحصول على حالة الفيسبوك الحالية",
	longDescription: "الحصول على حالة الفيسبوك الحالية",
	guide: "{pn}",
	text: {
		success: "تم إرسال حالة الفيسبوك إليك، يُرجى التحقق من الرسالة الخاصة بالبوت"
	}
},
grouptag: {
	shortDescription: "وسم الأعضاء بواسطة مجموعة",
	longDescription: "وسم الأعضاء بواسطة مجموعة",
	guide: "   {pn} add <اسم وسم المجموعة> <@أوامر>: يُستخدم لإضافة وسم مجموعة جديد أو إضافة أعضاء إلى وسم المجموعة\n   مثال:\n    {pn} TEAM1 @عضو1 @عضو2\n\n   {pn} del <اسم وسم المجموعة> <@أوامر>: يُستخدم لإزالة أعضاء من وسم المجموعة\n   مثال:\n    {pn} del TEAM1 @عضو1 @عضو2\n\n   {pn} remove <اسم وسم المجموعة>: يُستخدم لإزالة وسم المجموعة\n   مثال:\n    {pn} remove TEAM1\n\n   {pn} rename <اسم وسم المجموعة> | <اسم وسم مجموعة جديد>: يُستخدم لإعادة تسمية وسم المجموعة\n\n   {pn} [list | all]: يُستخدم لعرض قائمة بوسوم المجموعة في محادثتك الجماعية\n\n   {pn} info <اسم وسم المجموعة>: يُستخدم لعرض معلومات وسم المجموعة",
	text: {
		noGroupTagName: "الرجاء إدخال اسم وسم المجموعة",
		noMention: "لم تقم بوسم أي عضو لإضافته إلى وسم المجموعة",
		addedSuccess: "تمت إضافة الأعضاء:\n%1\nإلى وسم المجموعة \"%2\"",
		addedSuccess2: "تمت إضافة وسم المجموعة \"%1\" مع الأعضاء:\n%2",
		existedInGroupTag: "الأعضاء:\n%1\nموجودون بالفعل في وسم المجموعة \"%2\"",
		notExistedInGroupTag: "الأعضاء:\n%1\nغير موجودون في وسم المجموعة \"%2\"",
		noExistedGroupTag: "وسم المجموعة \"%1\" غير موجود في محادثتك الجماعية",
		noExistedGroupTag2: "محادثتك الجماعية لم تضيف أي وسوم مجموعة بعد",
		noMentionDel: "الرجاء وسم الأعضاء الذين ترغب في إزالتهم من وسم المجموعة \"%1\"",
		deletedSuccess: "تمت إزالة الأعضاء:\n%1\nمن وسم المجموعة \"%2\"",
		deletedSuccess2: "تم حذف وسم المجموعة \"%1\"",
		tagged: "وسم المجموعة \"%1\":\n%2",
		noGroupTagName2: "الرجاء إدخال اسم وسم المجموعة القديم والجديد، مفصولة بـ \"|\"",
		renamedSuccess: "تمت إعادة تسمية وسم المجموعة \"%1\" إلى \"%2\"",
		infoGroupTag: "📑 | اسم المجموعة: \"%1\"\n👥 | عدد الأعضاء: %2\n👨‍👩‍👧‍👦 | قائمة الأعضاء:\n %3"
	}
},
help: {
	shortDescription: "عرض استخدام الأوامر",
	longDescription: "عرض استخدام الأوامر",
	guide: "{pn} [فارغ | <رقم الصفحة> | <اسم الأمر>]",
	text: {
		help: "╭─────────────⭓\n%1\n├─────⭔\n│ الصفحة [ %2/%3 ]\n│ حاليًا، البوت يحتوي على %4 أوامر يمكن استخدامها\n│ » اكتب %5help <صفحة> لعرض قائمة الأوامر\n│ » اكتب %5help لعرض تفاصيل كيفية استخدام الأمر\n├────────⭔\n│ %6\n╰─────────────⭓",
		help2: "%1├───────⭔\n│ » حاليًا، البوت يحتوي على %2 أوامر يمكن استخدامها\n│ » اكتب %3help <اسم الأمر> لعرض تفاصيل كيفية استخدام الأمر\n│ %4\n╰─────────────⭓",
		commandNotFound: "الأمر \"%1\" غير موجود",
		getInfoCommand: "╭── الاسم ────⭓\n│ %1\n├── المعلومات\n│ الوصف: %2\n│ أسماء أخرى: %3\n│ أسماء أخرى في مجموعتك: %4\n│ الإصدار: %5\n│ الدور: %6\n│ الوقت لكل أمر: %7 ثانية\n│ الكاتب: %8\n├── الاستخدام\n%9\n├── ملاحظات\n│ يمكن تغيير المحتوى بين <XXXXX>\n│ المحتوى بين [a|b|c] هو a أو b أو c\n╰──────⭔",
		doNotHave: "لا يوجد",
		roleText0: "0 (جميع المستخدمين)",
		roleText1: "1 (مسؤولو المجموعة)",
		roleText2: "2 (مشرف البوت)",
		roleText0setRole: "0 (تعيين الدور، جميع المستخدمين)",
		roleText1setRole: "1 (تعيين الدور، مسؤولو المجموعة)",
		pageNotFound: "الصفحة %1 غير موجودة"
	}
},
kick: {
	shortDescription: "طرد عضو",
	longDescription: "طرد عضو من المحادثة",
	guide: "{pn} @الوسوم: استخدم لطرد الأعضاء الذين تم وسمهم"
},
loadconfig: {
	shortDescription: "إعادة تحميل التكوين",
	longDescription: "إعادة تحميل تكوين البوت"
},
moon: {
	shortDescription: "عرض صورة القمر",
	longDescription: "عرض صورة القمر في الليلة التي تختارها (يوم/شهر/سنة)",
	guide: "  {pn} <يوم/شهر/سنة>\n   {pn} <يوم/شهر/سنة> <نص التوضيح>",
	text: {
		invalidDateFormat: "يرجى إدخال تاريخ صالح بتنسيق يوم/شهر/سنة",
		error: "حدث خطأ أثناء الحصول على صورة القمر في %1",
		invalidDate: "%1 ليس تاريخًا صالحًا",
		caption: "- صورة القمر في %1"
	}
},
notification: {
	shortDescription: "إرسال إشعار من المسؤول إلى جميع الصناديق",
	longDescription: "إرسال إشعار من المسؤول إلى جميع الصناديق",
	guide: "{pn} <رسالة>",
	text: {
		missingMessage: "الرجاء إدخال الرسالة التي ترغب في إرسالها إلى جميع الصناديق",
		notification: "إشعار من البوت المسؤول إلى جميع صناديق الدردشة (لا تقم بالرد على هذه الرسالة)",
		sendingNotification: "بدء إرسال الإشعار من البوت المسؤول إلى %1 صندوق دردشة",
		sentNotification: "✅ تم إرسال الإشعار إلى %1 صندوق بنجاح",
		errorSendingNotification: "حدث خطأ أثناء الإرسال إلى %1 صندوق:\n %2"
	}
},
prefix: {
	shortDescription: "تغيير بادئة البوت",
	longDescription: "تغيير بادئة الأمر للبوت في صندوق الدردشة الخاص بك أو لنظام البوت بأكمله (فقط للبوت المسؤول)",
	guide: "   {pn} <بادئة جديدة>: تغيير البادئة الجديدة في صندوق الدردشة الخاص بك\n   مثال:\n    {pn} #\n\n   {pn} <بادئة جديدة> -g: تغيير البادئة الجديدة في نظام البوت (فقط للبوت المسؤول)\n   مثال:\n    {pn} # -g\n\n   {pn} reset: تغيير البادئة في صندوق الدردشة الخاص بك إلى الإعداد الافتراضي",
	text: {
		reset: "تمت إعادة تعيين بادئتك إلى الإعداد الافتراضي: %1",
		onlyAdmin: "يمكن للمسؤول فقط تغيير بادئة البوت للنظام",
		confirmGlobal: "يرجى الرد على هذه الرسالة لتأكيد تغيير بادئة البوت للنظام",
		confirmThisThread: "يرجى الرد على هذه الرسالة لتأكيد تغيير بادئة البوت في صندوق الدردشة الخاص بك",
		successGlobal: "تم تغيير بادئة البوت للنظام إلى: %1",
		successThisThread: "تم تغيير بادئة البوت في صندوق الدردشة الخاص بك إلى: %1",
		myPrefix: "🌐 بادئة النظام: %1\n🛸 بادئة صندوق الدردشة الخاص بك: %2"
	}
},
rank: {
	shortDescription: "عرض مستوى المستخدم",
	longDescription: "عرض مستواك أو مستوى الشخص الموسوم به. يمكنك وسم العديد من الأشخاص"
},
rankup: {
	shortDescription: "تشغيل/إيقاف إشعار التقدم في المستوى",
	longDescription: "تشغيل/إيقاف إشعار التقدم في المستوى",
	guide: "{pn} [تشغيل | إيقاف]",
	text: {
		syntaxError: "خطأ في الصياغة، استخدم فقط {pn} تشغيل أو {pn} إيقاف",
		turnedOn: "تم تشغيل إشعار التقدم في المستوى",
		turnedOff: "تم إيقاف إشعار التقدم في المستوى",
		notiMessage: "🎉🎉 تهانينا على الوصول إلى المستوى %1"
	}
},
refresh: {
	shortDescription: "تحديث المعلومات",
	longDescription: "تحديث معلومات دردشة المجموعة أو المستخدم",
	guide: "   {pn} [thread | group]: تحديث معلومات دردشة مجموعتك\n   {pn} group <معرف_الدردشة>: تحديث معلومات دردشة المجموعة باستخدام معرف الدردشة\n\n   {pn} user: تحديث معلومات مستخدمك\n   {pn} user [<معرف_المستخدم> | @الإشارة]: تحديث معلومات مستخدم بواسطة معرف المستخدم",
	text: {
		refreshMyThreadSuccess: "✅ | تم تحديث معلومات دردشة مجموعتك بنجاح!",
		refreshThreadTargetSuccess: "✅ | تم تحديث معلومات دردشة المجموعة %1 بنجاح!"
	}
},
rules: {
	shortDescription: "قوانين المجموعة",
	longDescription: "إنشاء/عرض/إضافة/تحرير/تغيير الموقف/حذف قوانين المجموعة الخاصة بك",
	guide: "   {pn} [add | -a] <القاعدة التي تريد إضافتها>: إضافة قاعدة للمجموعة.\n   {pn}: عرض قوانين المجموعة.\n   {pn} [edit | -e] <رقم القاعدة> <المحتوى بعد التحرير>: تحرير القاعدة رقم <رقم القاعدة>.\n   {pn} [move | -m] <رقم1> <رقم2> تبديل موقع القاعدة رقم <رقم1> و <رقم2>.\n   {pn} [delete | -d] <رقم>: حذف القاعدة رقم <رقم>.\n   {pn} [remove | -r]: حذف جميع قوانين المجموعة.",
},
sendnoti: {
	shortDescription: "إنشاء وإرسال إشعار إلى الدردشات",
	longDescription: "إنشاء وإرسال إشعار إلى الدردشات التي تديرها",
	guide: "   {pn} create <اسم_المجموعة>: إنشاء مجموعة إشعار جديدة باسم <اسم_المجموعة>\n   مثال:\n    {pn} create TEAM1\n\n   {pn} add <اسم_المجموعة>: إضافة دردشة الصندوق الحالية إلى مجموعة الإشعار <اسم_المجموعة> (يجب أن تكون مشرفًا على هذه الدردشة)\n   مثال:\n    {pn} add TEAM1\n\n   {pn} delete: إزالة دردشة الصندوق الحالية من مجموعة الإشعار <اسم_المجموعة> (يجب أن تكون مالك هذه المجموعة)\n   مثال:\n    {pn} delete TEAM1\n\n   {pn} send <اسم_المجموعة> | <الرسالة>: إرسال إشعار إلى جميع الدردشات في مجموعة الإشعار <اسم_المجموعة> (يجب أن تكون مشرفًا على تلك الدردشات)\n   مثال:\n    {pn} send TEAM1 | مرحبًا بكم في فريق TEAM1\n\n   {pn} remove <اسم_المجموعة>: إزالة مجموعة الإشعار <اسم_المجموعة> (يجب أن تكون مالك هذه المجموعة)\n   مثال:\n    {pn} remove TEAM1",
	text: {
		missingGroupName: "الرجاء إدخال اسم مجموعة الإشعار",
		groupNameExists: "تم إنشاء مجموعة الإشعار بالفعل باسم %1 من قبلك، يرجى اختيار اسم آخر",
		createdGroup: "تم إنشاء مجموعة الإشعار بنجاح:\n- الاسم: %1\n- المعرف: %2",
		missingGroupNameToAdd: "الرجاء إدخال اسم مجموعة الإشعار التي تريد إضافة دردشة الصندوق الحالية إليها",
		groupNameNotExists: "لم تقم بإنشاء أو إدارة أي مجموعة إشعار بالاسم: %1",
		notAdmin: "أنت لست مشرفًا على هذه الدردشة",
		added: "تمت إضافة دردشة الصندوق الحالية إلى مجموعة الإشعار: %1",
		missingGroupNameToDelete: "الرجاء إدخال اسم مجموعة الإشعار التي تريد حذف دردشة الصندوق الحالية منها",
		notInGroup: "دردشة الصندوق الحالية غير موجودة في مجموعة الإشعار %1",
		deleted: "تم حذف دردشة الصندوق الحالية من مجموعة الإشعار: %1",
		failed: "فشل في إرسال إشعار إلى %1 دردشة:\n%2",
		missingGroupNameToRemove: "الرجاء إدخال اسم مجموعة الإشعار التي تريد إزالتها",
		removed: "تمت إزالة مجموعة الإشعار: %1",
		missingGroupNameToSend: "الرجاء إدخال اسم مجموعة الإشعار التي تريد إرسال الرسالة إليها",
		groupIsEmpty: "مجموعة الإشعار \"%1\" فارغة",
		sending: "جاري إرسال إشعار إلى %1 دردشة",
		success: "تم إرسال إشعار إلى %1 دردشة في مجموعة الإشعار \"%2\" بنجاح",
		notAdminOfGroup: "أنت لست مشرفًا على هذه المجموعة",
		missingGroupNameToView: "الرجاء إدخال اسم مجموعة الإشعار التي تريد عرض معلوماتها",
		groupInfo: "- اسم المجموعة: %1\n - المعرف: %2\n - تم الإنشاء في: %3\n%4 ",
		groupInfoHasGroup: "- تحتوي على الدردشات: \n%1",
		noGroup: "لم تقم بإنشاء أو إدارة أي مجموعة إشعار"
	}
},
setalias: {
	shortDescription: "إضافة اختصار للأمر",
	longDescription: "إضافة اختصار لأي أمر في مجموعتك",
	guide: "  يُستخدم هذا الأمر لإضافة/إزالة اختصار لأي أمر في مجموعتك\n   {pn} add <الاختصار> <الأمر>: إضافة اختصار للأمر في مجموعتك\n   {pn} add <الاختصار> <الأمر> -g: إضافة اختصار للأمر في النظام بأكمله (فقط لمشرفي البوت)\nمثال:\n    {pn} add ctrk customrankcard\n\n   {pn} [remove | rm] <الاختصار> <الأمر>: إزالة اختصار للأمر في مجموعتك\n   {pn} [remove | rm] <الاختصار> <الأمر> -g: إزالة اختصار للأمر في النظام بأكمله (فقط لمشرفي البوت)\nمثال:\n    {pn} rm ctrk customrankcard\n\n   {pn} list: عرض كل الاختصارات للأوامر في مجموعتك\n   {pn} list -g: عرض كل الاختصارات للأوامر في النظام بأكمله"
},
setavt: {
	shortDescription: "تغيير صورة البوت",
	longDescription: "تغيير صورة البوت",
	text: {
		cannotGetImage: "❌ | حدث خطأ أثناء استعلام عن عنوان الصورة",
		invalidImageFormat: "❌ | صيغة صورة غير صالحة",
		changedAvatar: "✅ | تم تغيير صورة البوت بنجاح"
	}
},
setlang: {
	shortDescription: "تعيين اللغة الافتراضية",
	longDescription: "تعيين اللغة الافتراضية للبوت في الدردشة الحالية أو جميع الدردشات",
	guide: "   {pn} <رمز اللغة ISO 639-1>\n   مثال:    {pn} en    {pn} vi    {pn} ja",
	text: {
		setLangForAll: "تعيين اللغة الافتراضية لجميع الدردشات: %1",
		setLangForCurrent: "تعيين اللغة الافتراضية للدردشة الحالية: %1",
		noPermission: "يمكن لمشرف البوت فقط استخدام هذا الأمر"
	}
},
setleave: {
	shortDescription: "تعديل رسالة المغادرة",
	longDescription: "تعديل محتوى/تشغيل أو إيقاف رسالة المغادرة عند مغادرة الأعضاء لدردشة مجموعتك",
	guide: {
		body: "   {pn} on: تشغيل رسالة المغادرة\n   {pn} off: إيقاف رسالة المغادرة\n   {pn} text [<المحتوى> | reset]: تعديل محتوى النص أو إعادته إلى الإعداد الافتراضي، يمكن استخدام الاختصارات التالية:\n  + {userName}: اسم العضو الذي غادر المجموعة\n  + {userNameTag}: اسم العضو الذي غادر المجموعة (بالعلامة)\n  + {boxName}: اسم دردشة المجموعة\n  + {type}: غادر/تم طرده بواسطة المشرف\n  + {session}: الجلسة في اليوم\n\n   مثال:\n    {pn} text {userName} غادر المجموعة بواسطة {type}، أراك مرة أخرى 🤧\n\n   قم بالرد على هذه الرسالة أو إرسال رسالة مع ملف مرفق يحتوي على {pn} file: لإضافة ملف مرفق إلى رسالة المغادرة (صورة، فيديو، صوت)\n\nمثال:\n   {pn} file reset: إعادة تعيين الملف",
		attachment: {
			[`${process.cwd()}/scripts/cmds/assets/guide/setleave/setleave_en_1.png`]: "https://i.ibb.co/2FKJHJr/guide1.png"
		}
	},
	text: {
		missingContent: "الرجاء إدخال المحتوى",
		edited: "تم تعديل محتوى رسالة المغادرة في مجموعتك إلى:\n%1",
		reseted: "تمت إعادة تعيين محتوى رسالة المغادرة",
		noFile: "لا توجد ملفات مرفقة في رسالة المغادرة لإعادة تعيينها",
		resetedFile: "تمت إعادة تعيين ملف المرفق في رسالة المغادرة بنجاح",
		missingFile: "الرجاء الرد على هذه الرسالة بملف صورة/فيديو/صوت"
	}
},
setname: {
	shortDescription: "تغيير الاسم المستعار",
	longDescription: "تغيير الاسم المستعار لجميع الأعضاء في الدردشة أو الأعضاء الذين تم وسمهم بناءً على تنسيق",
	guide: {
		body: "   {pn} <اسم اللقب>: تغيير الاسم المستعار الخاص بك\n   {pn} @tags <اسم اللقب>: تغيير الاسم المستعار للأعضاء الذين تم وسمهم\n   {pn} all <اسم اللقب>: تغيير الاسم المستعار لجميع الأعضاء في الدردشة\n\nمع الاختصارات المتاحة:\n   + {userName}: اسم العضو\n   + {userID}: معرف العضو\n\n   مثال: (انظر الصور)"
	},
	attachment: {
		[`${process.cwd()}/scripts/cmds/assets/guide/setname_1.png`]: "https://i.ibb.co/gFh23zb/guide1.png",
		[`${process.cwd()}/scripts/cmds/assets/guide/setname_2.png`]: "https://i.ibb.co/BNWHKgj/guide2.png"
	},
	text: {
		error: "حدث خطأ، حاول إيقاف ميزة رابط الدعوة في المجموعة وحاول مرة أخرى في وقت لاحق"
	}
},
setrole: {
	shortDescription: "تحرير دور الأمر",
	longDescription: "تحرير دور الأمر (الأوامر مع دور أقل من 2)",
	guide: "   {pn} <اسم الأمر> <دور جديد>: تعيين دور جديد للأمر\n   باستخدام:\n   + <اسم الأمر>: اسم الأمر\n   + <دور جديد>: الدور الجديد للأمر مع:\n   + <دور جديد> = 0: يمكن استخدام الأمر من قبل جميع أعضاء المجموعة\n   + <دور جديد> = 1: يمكن استخدام الأمر فقط من قبل المشرفين\n   + <دور جديد> = default: إعادة تعيين دور الأمر إلى الإعداد الافتراضي\n   مثال:\n    {pn} rank 1: (أمر rank يمكن استخدامه فقط من قبل المشرفين)\n    {pn} rank 0: (أمر rank يمكن استخدامه من قبل جميع أعضاء المجموعة)\n    {pn} rank default: إعادة تعيينه إلى الإعداد الافتراضي\n—————\n   {pn} [viewrole|view|show]: عرض الدور للأوامر المحررة",
	text: {
		noEditedCommand: "✅ المجموعة الخاصة بك ليس لديها أوامر محررة",
		editedCommand: "⚠️ المجموعة الخاصة بك لديها أوامر محررة:\n",
		noPermission: "❗ يمكن للمشرفين فقط استخدام هذا الأمر",
		commandNotFound: "الأمر \"%1\" غير موجود",
		noChangeRole: "❗ لا يمكن تغيير دور الأمر \"%1\"",
		resetRole: "تم إعادة تعيين دور الأمر \"%1\" إلى الإعداد الافتراضي",
		changedRole: "تم تغيير دور الأمر \"%1\" إلى %2"
	}
},
setwelcome: {
	shortDescription: "تحرير محتوى رسالة الترحيب",
	longDescription: "تحرير محتوى رسالة الترحيب عندما ينضم عضو جديد إلى مجموعتك",
	guide: {
		body: "   {pn} text [<المحتوى> | reset]: تحرير محتوى النص أو إعادة تعيينه إلى الإعداد الافتراضي، مع بعض الاختصارات:\n  + {userName}: اسم العضو الجديد\n  + {userNameTag}: اسم العضو الجديد (وسم)\n  + {boxName}: اسم مجموعة الدردشة\n  + {multiple}: أنت || أنتم\n  + {session}: جلسة في اليوم\n\n   مثال:\n    {pn} text مرحبًا {userName}، مرحبًا بك في {boxName}، نتمنى لك يومًا سعيدًا {multiple}\n\n   رد (phản hồi) أو إرسال رسالة مع ملف بهذا المحتوى {pn} file: لإضافة ملفات مرفقة برسالة الترحيب (صورة، فيديو، صوت)\n\n   مثال:\n    {pn} file reset: حذف الملف المرفق"
	},
	attachment: {
		[`${process.cwd()}/scripts/cmds/assets/guide/setwelcome/setwelcome_en_1.png`]: "https://i.ibb.co/vsCz0ks/setwelcome-en-1.png"
	},
	text: {
		missingContent: "الرجاء إدخال محتوى رسالة الترحيب",
		edited: "تم تحرير محتوى رسالة الترحيب في مجموعتك إلى: %1",
		reseted: "تم إعادة تعيين محتوى رسالة الترحيب",
		noFile: "لا توجد مرفقات ملف لحذفها",
		resetedFile: "تمت إعادة تعيين مرفقات الملفات بنجاح",
		missingFile: "الرجاء الرد على هذه الرسالة بملف صورة/فيديو/صوت"
	}
},
shortcut: {
	shortDescription: "إضافة اختصار لك",
	longDescription: "إضافة اختصار لرسالتك في مجموعة الدردشة",
	text: {
		missingContent: 'الرجاء إدخال محتوى الرسالة',
		shortcutExists: 'الاختصار "%1" موجود بالفعل، قم بالرد على هذه الرسالة لاستبدال محتوى الاختصار',
		shortcutExistsByOther: 'الاختصار %1 تمت إضافته بواسطة عضو آخر، يرجى المحاولة بكلمة أخرى',
		added: 'تمت إضافة الاختصار %1 => %2',
		addedAttachment: ' مع %1 مرفقات',
		missingKey: 'الرجاء إدخال كلمة مفتاحية للاختصار الذي تريد حذفه',
		notFound: 'لم يتم العثور على اختصار للكلمة المفتاحية %1 في مجموعتك',
		onlyAdmin: 'يمكن للمشرفين فقط حذف اختصارات الأشخاص الآخرين',
		deleted: 'تم حذف الاختصار %1',
		empty: 'مجموعة الدردشة الخاصة بك لم تقم بإضافة أي اختصارات',
		message: 'رسالة',
		attachment: 'مرفق',
		list: 'قائمة اختصاراتك',
		onlyAdminRemoveAll: 'يمكن للمشرفين فقط إزالة جميع الاختصارات في مجموعة الدردشة',
		confirmRemoveAll: 'هل تريد بالتأكيد إزالة جميع الاختصارات في مجموعة الدردشة هذه؟ (قم بالرد على هذه الرسالة للتأكيد)',
		removedAll: 'تمت إزالة جميع الاختصارات في مجموعة الدردشة الخاصة بك'
	}
},
simsimi: {
	shortDescription: "سمسمي",
	longDescription: "الدردشة مع سمسمي",
	guide: "   {pn} [تشغيل | إيقاف]: تشغيل/إيقاف سمسمي\n\n   {pn} <كلمة>: الدردشة مع سمسمي\n   مثال:\n    {pn} مرحبًا",
	text: {
		turnedOn: "تم تشغيل سمسمي بنجاح!",
		turnedOff: "تم إيقاف سمسمي بنجاح!",
		chatting: "جاري الدردشة مع سمسمي...",
		error: "سمسمي مشغول، يرجى المحاولة مرة أخرى لاحقًا"
	}
},
sorthelp: {
	shortDescription: "فرز قائمة المساعدة",
	longDescription: "فرز قائمة المساعدة",
	guide: "{pn} [اسم | فئة]",
	text: {
		savedName: "تم حفظ فرز قائمة المساعدة حسب الاسم",
		savedCategory: "تم حفظ فرز قائمة المساعدة حسب الفئة"
	}
},
thread: {
	shortDescription: "إدارة مجموعة الدردشة",
	longDescription: "إدارة مجموعة الدردشة في نظام البوت",
	guide: "   {pn} [بحث | -f | بحث | -s] <اسم للبحث>: البحث عن مجموعة الدردشة في بيانات البوت حسب الاسم\n   {pn} [بحث | -f | بحث | -s] [-j | انضم] <اسم للبحث>: البحث عن مجموعة الدردشة في بيانات البوت التي لا يزال البوت متصلاً بها حسب الاسم\n   {pn} [حظر | -b] [<tid> | اتركه فارغًا] <سبب>: استخدمه لحظر مجموعة بالرقم المعرف <tid> أو المجموعة الحالية باستخدام البوت\n   مثال:\n    {pn} حظر 3950898668362484 البريد العشوائي البوت\n    {pn} حظر البريد العشوائي الكثير\n    {pn} فك الحظر [<tid> | اتركه فارغًا] لإلغاء حظر مجموعة بالرقم المعرف <tid> أو المجموعة الحالية",
	text: {
		noPermission: "ليس لديك الإذن لاستخدام هذه الميزة",
		found: "🔎 تم العثور على %1 مجموعة تطابق كلمة البحث \"%3\" في بيانات البوت:\n%3",
		notFound: "❌ لم يتم العثور على مجموعة تطابق كلمة البحث: \"%1\" في بيانات البوت",
		hasBanned: "تم حظر مجموعة بالرقم المعرف [%1 | %2] من قبل:\n» السبب: %3\n» الوقت: %4",
		banned: "تم حظر مجموعة بالرقم المعرف [%1 | %2] باستخدام البوت.\n» السبب: %3\n» الوقت: %4",
		notBanned: "مجموعة بالرقم المعرف [%1 | %2] غير محظورة باستخدام البوت",
		unbanned: "تم إلغاء حظر مجموعة بالرقم المعرف [%1 | %2] باستخدام البوت",
		missingReason: "لا يمكن ترك سبب الحظر فارغًا",
		info: "» معرف المجموعة: %1\n» الاسم: %2\n» تاريخ إنشاء البيانات: %3\n» إجمالي الأعضاء: %4\n» الذكور: %5 أعضاء\n» الإناث: %6 أعضاء\n» إجمالي الرسائل: %7%8"
	}
},
tid: {
	shortDescription: "عرض معرّف المحادثة",
	longDescription: "عرض معرّف المحادثة في مجموعتك",
	guide: "{pn}"
},
tik: {
	shortDescription: "تنزيل مقاطع TikTok",
	longDescription: "قم بتنزيل مقاطع الفيديو/الصور (سلايدر)، والصوت من روابط TikTok",
	guide: "   {pn} [فيديو|-v|v] <الرابط>: استخدمه لتنزيل مقاطع الفيديو/الصور (سلايدر) من رابط TikTok.\n   {pn} [صوت|-a|a] <الرابط>: استخدمه لتنزيل الملف الصوتي من رابط TikTok",
	text: {
		invalidUrl: "الرجاء إدخال رابط TikTok صالح",
		downloadingVideo: "جاري تنزيل الفيديو: %1...",
		downloadedSlide: "تم تنزيل السلايد: %1\n%2",
		downloadedVideo: "تم تنزيل الفيديو: %1\nرابط التنزيل: %2",
		downloadingAudio: "جاري تنزيل الملف الصوتي: %1...",
		downloadedAudio: "تم تنزيل الملف الصوتي: %1"
	}
},
trigger: {
	shortDescription: "إثارة الصور",
	longDescription: "إثارة الصور",
	guide: "{pn} [@تاغ | فارغ]"
},
uid: {
	shortDescription: "عرض معرف المستخدم",
	longDescription: "عرض معرف المستخدم في فيسبوك",
	guide: "   {pn}: استخدمها لعرض معرف المستخدم في فيسبوك الخاص بك\n   {pn} @تاغ: عرض معرف المستخدم في فيسبوك للأشخاص الموسومين\n   {pn} <رابط الملف الشخصي>: عرض معرف المستخدم في فيسبوك لرابط الملف الشخصي",
	text: {
		syntaxError: "الرجاء وسم الشخص الذي ترغب في عرض معرفه أو اتركه فارغًا لعرض معرفك الخاص"
	}
},
unsend: {
	shortDescription: "إلغاء إرسال رسالة البوت",
	longDescription: "إلغاء إرسال رسالة البوت",
	guide: "قم بالرد على الرسالة التي ترغب في إلغاء إرسالها واستدعاء الأمر {pn}",
	text: {
		syntaxError: "الرجاء الرد على الرسالة التي ترغب في إلغاء إرسالها"
	}
},
user: {
	shortDescription: "إدارة المستخدمين",
	longDescription: "إدارة المستخدمين في نظام البوت",
	guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث عن مستخدمين في بيانات البوت حسب الاسم\n\n   {pn} [ban | -b] [<uid> | @تاغ | الرد على الرسالة] <السبب>: لحظر المستخدم بمعرف <uid> أو تاغ المستخدم أو مرسل الرسالة المردودة باستخدام البوت\n\n   {pn} unban [<uid> | @تاغ | الرد على الرسالة]: لإلغاء حظر المستخدم باستخدام البوت",
	text: {
		noUserFound: "❌ لا يوجد مستخدمين مطابقين للكلمة الرئيسية: \"%1\" في بيانات البوت",
		userFound: "🔎 تم العثور على %1 مستخدم مطابقين للكلمة الرئيسية \"%2\" في بيانات البوت:\n%3",
		uidRequired: "معرّف المستخدم للحظر لا يمكن أن يكون فارغًا، الرجاء إدخال معرف المستخدم أو تاغه أو الرد على الرسالة باستخدام أمر ban <uid> <السبب>",
		reasonRequired: "سبب حظر المستخدم لا يمكن أن يكون فارغًا، الرجاء إدخال معرف المستخدم أو تاغه أو الرد على الرسالة باستخدام أمر ban <uid> <السبب>",
		userHasBanned: "المستخدم بمعرّف [%1 | %2] تم حظره من قبل:\n» السبب: %3\n» التاريخ: %4",
		userBanned: "تم حظر المستخدم بمعرّف [%1 | %2]:\n» السبب: %3\n» التاريخ: %4",
		uidRequiredUnban: "معرّف المستخدم لإلغاء الحظر لا يمكن أن يكون فارغًا",
		userNotBanned: "المستخدم بمعرّف [%1 | %2] لم يتم حظره",
		userUnbanned: "تم إلغاء حظر المستخدم بمعرّف [%1 | %2]"
	}
},
videofb: {
	shortDescription: "تحميل فيديو من Facebook",
	longDescription: "تحميل فيديو/قصة من Facebook (عام)",
	guide: "   {pn} <رابط الفيديو/القصة>: قم بتحميل الفيديو من Facebook",
	text: {
		missingUrl: "الرجاء إدخال رابط الفيديو/القصة على Facebook (عام) الذي ترغب في تحميله",
		error: "حدث خطأ أثناء تنزيل الفيديو",
		downloading: "جاري تنزيل الفيديو لك",
		tooLarge: "عذرًا، لا يمكننا تنزيل الفيديو لك لأن الحجم أكبر من 83 ميجابايت"
	}
},
warn: {
    shortDescription: "تحذير الأعضاء",
    longDescription: "تحذير الأعضاء في المجموعة، إذا وصل عدد التحذيرات إلى 3، سيتم حظرهم",
    guide: "   {pn} @tag <السبب>: لتحذير عضو\n   {pn} list: لعرض قائمة الأعضاء الذين تم تحذيرهم\n   {pn} listban: لعرض قائمة الأعضاء الذين تم تحذيرهم 3 مرات وتم حظرهم\n   {pn} info [@tag | <uid> | اتركه فارغاً]: لعرض معلومات التحذير للعضو المعني أو UID أو نفسك\n   {pn} unban <uid>: لرفع الحظر عن عضو عبر UID\n   {pn} unwarn <uid> [<عدد التحذيرات> | اتركه فارغاً]: لرفع التحذير عن عضو عبر UID وعدد التحذير\n   {pn} warn reset: لإعادة تعيين جميع بيانات التحذير\n⚠️ يجب عليك منح البوت صلاحية الإدارة لتمكينه من طرد الأعضاء المحظورين تلقائياً",
    text: {
        list: "قائمة الأعضاء الذين تم تحذيرهم:\n%1\n\nلعرض تفاصيل التحذيرات، استخدم الأمر \"%2warn info [@tag | <uid> | اتركه فارغاً]\": لعرض معلومات التحذير للشخص المعني أو UID أو نفسك",
        listBan: "قائمة الأعضاء الذين تم تحذيرهم 3 مرات وتم حظرهم من المجموعة:\n%1",
        listEmpty: "لا يوجد أعضاء تم تحذيرهم في مجموعتك",
        listBanEmpty: "لا يوجد أعضاء تم حظرهم من المجموعة",
        invalidUid: "الرجاء إدخال UID صالح للشخص الذي ترغب في عرض معلوماته",
        noData: "لا توجد بيانات",
        noPermission: "❌ يمكن لمسؤولي المجموعة فقط رفع الحظر عن الأعضاء المحظورين من المجموعة",
        invalidUid2: "⚠️ الرجاء إدخال UID صالح للشخص الذي ترغب في رفع الحظر عنه",
        notBanned: "⚠️ المستخدم بـ UID %1 لم يتم حظره من مجموعتك",
        unbanSuccess: "✅ تم رفع الحظر بنجاح عن العضو بـ [%1 | %2]، حالياً يمكن لهذا الشخص الانضمام إلى مجموعتك",
        noPermission2: "❌ يمكن لمسؤولي المجموعة فقط إزالة التحذيرات من أعضاء المجموعة",
        invalidUid3: "⚠️ الرجاء إدخال UID أو علامة على الشخص الذي ترغب في رفع التحذير عنه",
        noData2: "⚠️ المستخدم بـ UID %1 ليس لديه بيانات تحذير",
        notEnoughWarn: "❌ المستخدم %1 لديه فقط %2 تحذير",
        unwarnSuccess: "✅ تم رفع تحذير %1 من العضو بـ [%2 | %3]",
        noPermission3: "❌ يمكن لمسؤولي المجموعة فقط إعادة تعيين بيانات التحذير",
        resetWarnSuccess: "✅ تم إعادة تعيين بيانات التحذير بنجاح",
        noPermission4: "❌ يمكن لمسؤولي المجموعة فقط تحذير الأعضاء في المجموعة",
        invalidUid4: "⚠️ يجب عليك علامة على الشخص الذي ترغب في تحذيره أو الرد على رسالته",
        warnSuccess: "⚠️ تم تحذير العضو %1 مرات %2\n- UID: %3\n- السبب: %4\n- تاريخ ووقت: %5\nتم تحذير هذا العضو 3 مرات وتم حظره من المجموعة، لرفع الحظر استخدم الأمر \"%6warn unban <uid>\" (مع UID هو UID الشخص الذي تريد رفع الحظر عنه)",
        noPermission5: "⚠️ البوت يحتاج إلى صلاحيات مسؤول لطرد الأعضاء المحظورين",
        warnSuccess2: "⚠️ تم تحذير العضو %1 مرات %2\n- UID: %3\n- السبب: %4\n- تاريخ ووقت: %5\nإذا انتهك هذا الشخص %6 مرات أخرى، سيتم حظره من المجموعة",
        hasBanned: "⚠️ التالي هم الأعضاء الذين تم تحذيرهم 3 مرات مسبقاً وتم حظرهم من المجموعة:\n%1",
        failedKick: "⚠️ حدث خطأ عند طرد الأعضاء التاليين:\n%1"
  }
},
weather: {
    shortDescription: "تنبؤ بحالة الطقس",
    longDescription: "عرض توقعات حالة الطقس الحالية والخمسة أيام القادمة",
    guide: "{pn} <الموقع>",
    text: {
        syntaxError: "الرجاء إدخال موقع",
        notFound: "الموقع غير موجود: %1",
        error: "حدث خطأ: %1",
        today: "حالة الطقس اليوم:\n%1\n🌡 درجة الحرارة الصغرى - العظمى %2°C - %3°C\n🌡 الإحساس بدرجة الحرارة %4°C - %5°C\n🌅 شروق الشمس %6\n🌄 غروب الشمس %7\n🌃 شروق القمر %8\n🏙️ غروب القمر %9\n🌞 النهار: %10\n🌙 الليل: %11"
   }
},
ytb: {
    shortDescription: "يوتيوب",
    longDescription: "تنزيل مقاطع الفيديو أو الصوت أو عرض معلومات الفيديو على YouTube",
    guide: "   {pn} [فيديو|-v] [<اسم الفيديو>|<رابط الفيديو>]: استخدمه لتنزيل مقاطع الفيديو من YouTube.\n   {pn} [صوت|-a] [<اسم الفيديو>|<رابط الفيديو>]: استخدمه لتنزيل الصوت من YouTube\n   {pn} [معلومات|-i] [<اسم الفيديو>|<رابط الفيديو>]: استخدمه لعرض معلومات الفيديو من YouTube\n   مثال:\n    {pn} -v المملكة المتحدة المنسية\n    {pn} -a المملكة المتحدة المنسية\n    {pn} -i المملكة المتحدة المنسية",
    text: {
        error: "حدث خطأ: %1",
        noResult: "لا توجد نتائج بحث تتطابق مع الكلمة الرئيسية %1",
        choose: "%1أرسل ردًا على الرسالة مع الرقم للاختيار أو أي محتوى آخر للإلغاء",
        downloading: "جاري تنزيل الفيديو %1",
        noVideo: "عذرًا، لا توجد مقاطع فيديو بحجم أقل من 83 ميجابايت",
        downloadingAudio: "جاري تنزيل الصوت %1",
        noAudio: "عذرًا، لا يوجد صوت بحجم أقل من 26 ميجابايت",
        info: "💠 العنوان: %1\n🏪 القناة: %2\n👨‍👩‍👧‍👦 الاشتراك: %3\n⏱ مدة الفيديو: %4\n👀 المشاهدات: %5\n👍 الإعجابات: %6\n🆙 تاريخ النشر: %7\n🔠 المعرف: %8\n🔗 الرابط: %9",
        listChapter: "\n📖 قائمة الفصول: %1\n"
    }
	}
};

  
